# Azimuth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..Azimuth Property
SunAndShadowSettings Class See Also
---
Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Azimuth { get; set; }
```

Visual Basic
---
```text
Public Property Azimuth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Azimuth {
	double get ();
	void set (double value);
}
```

# ### Field Value
Azimuth angle (radians)
# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace